Revit 2024 API
UIMacroManager.EditMacro Method
 Edits the macro in sharp develop.
Namespace: Autodesk.Revit.UI.Macros
Assembly: RevitAPIUIMacros (in RevitAPIUIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void EditMacro(
	Macro macro
)
Visual Basic
Public Sub EditMacro ( _
	macro As Macro _
)
Visual C++
public:
void EditMacro(
	Macro^ macro
)
Parameters
macro
Type: Autodesk.Revit.DB.Macros.Macro
 The macro.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
UIMacroManager Class
Autodesk.Revit.UI.Macros Namespace